<div class="alert alert-block alert-success">
    <h1 align="center">Machine Learning in Python</h1>
    <h3 align="center">Session 03-1: Pandas (Data Selection)</h3>
    <h4 align="center">Fatemeh Fallah</h4>
</div>

In [1]:
#Let's Import the Packages...
import numpy as np
import pandas as pd

<img src="https://rolkra.github.io/images/explore-count-titanic.jpg"/>

In [2]:
#Let's Read csv file
titanic = pd.read_csv("Titanic-Dataset.csv")
#Show some records of dataframe
titanic.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
408,409,0,3,"Birkeland, Mr. Hans Martin Monsen",male,21.0,0,0,312992,7.7750,NaN,S
421,422,0,3,"Charters, Mr. David",male,21.0,0,0,A/5. 13032,7.7333,NaN,Q
230,231,1,1,"Harris, Mrs. Henry Birkhardt (Irene Wallach)",female,35.0,1,0,36973,83.4750,C83,S
838,839,1,3,"Chip, Mr. Chang",male,32.0,0,0,1601,56.4958,NaN,S
545,546,0,1,"Nicholson, Mr. Arthur Ernest",male,64.0,0,0,693,26.0000,NaN,S

In [3]:
type (titanic)

pandas.core.frame.DataFrame

## How do I select a subset of a DataFrame?¶

In this case, a subset of both rows and columns is made in one go and just using selection brackets [] is not sufficient anymore. The loc/iloc operators are required in front of the selection brackets []. When using loc/iloc, the part before the comma is the rows you want, and the part after the comma is the columns you want to select.

# Indexing and Selecting data

### Selecting a single column

In [8]:
single_column = titanic['Age']
single_column

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [9]:
type(single_column)

pandas.core.series.Series

### Selecting multiple columns

In [12]:
multiple_column = titanic[['Age','Pclass','Fare']]
multiple_column

      Age  Pclass     Fare
0    22.0       3   7.2500
1    38.0       1  71.2833
2    26.0       3   7.9250
3    35.0       1  53.1000
4    35.0       3   8.0500
..    ...     ...      ...
886  27.0       2  13.0000
887  19.0       1  30.0000
888   NaN       3  23.4500
889  26.0       1  30.0000
890  32.0       3   7.7500

[891 rows x 3 columns]

# REMEMBER

* When selecting subsets of data, square brackets [] are used.

* Inside these brackets, you can use a single column/row label, a list of column/row labels, a slice of labels, a conditional expression or a colon.

* Select specific rows and/or columns using loc when using the row and column names

* Select specific rows and/or columns using iloc when using the positions in the table

# iloc

### The .iloc attribute is the primary access method. The following are valid inputs:

- An integer e.g. 5.

- A list or array of integers [4, 3, 0].

- A slice object with ints 1:7.

- A boolean array.

- A callable, see Selection By Callable.

<img src="https://www.marsja.se/wp-content/uploads/2019/09/pandas_select_row_by_index_iloc.png">

### Selecting a single row

In [13]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [14]:
titanic.iloc[3]

PassengerId                                               4
Survived                                                  1
Pclass                                                    1
Name           Futrelle, Mrs. Jacques Heath (Lily May Peel)
Sex                                                  female
Age                                                      35
SibSp                                                     1
Parch                                                     0
Ticket                                               113803
Fare                                                   53.1
Cabin                                                  C123
Embarked                                                  S
Name: 3, dtype: object

### Selecting multiple rows

In [15]:
titanic.iloc[[3, 5, 7]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

### Selecting two rows and three columns

In [16]:
titanic.iloc[[3, 4], [1, 2,6]]

   Survived  Pclass  SibSp
3         1       1      1
4         0       3      0

### Selecting some rows and some columns

I’m interested in rows 10 till 25 and columns 3 to 5.

In [17]:
titanic.iloc[9:25, 2:5]

    Pclass                                               Name     Sex
9        2                Nasser, Mrs. Nicholas (Adele Achem)  female
10       3                    Sandstrom, Miss. Marguerite Rut  female
11       1                           Bonnell, Miss. Elizabeth  female
12       3                     Saundercock, Mr. William Henry    male
13       3                        Andersson, Mr. Anders Johan    male
14       3               Vestrom, Miss. Hulda Amanda Adolfina  female
15       2                   Hewlett, Mrs. (Mary D Kingcome)   female
16       3                               Rice, Master. Eugene    male
17       2                       Williams, Mr. Charles Eugene    male
18       3  Vander Planke, Mrs. Julius (Emelia Maria Vande...  female
19       3                            Masselmani, Mrs. Fatima  female
20       2                               Fynney, Mr. Joseph J    male
21       2                              Beesley, Mr. Lawrence    male
22       3                        McGowan, Miss. Anna "Annie"  female
23       1                       Sloper, Mr. William Thompson    male
24       3                      Palsson, Miss. Torborg Danira  female

### Selecting all the rows and a some columns

<img src="https://www.marsja.se/wp-content/uploads/2019/09/iloc_select_all_rows_and_first_column_in_pandas.png">

In [18]:
titanic.iloc[:, [1, 2]]

     Survived  Pclass
0           0       3
1           1       1
2           1       3
3           1       1
4           0       3
..        ...     ...
886         0       2
887         1       1
888         0       3
889         1       1
890         0       3

[891 rows x 2 columns]

In [19]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [23]:
col=[False, False, True, True, True,False, False, True, True, True,False, True]

In [24]:
titanic.iloc[1:10,col]

,Pclass,Name,Sex,Parch,Ticket,Fare,Embarked
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,0,PC 17599,71.2833,C
2,3,"Heikkinen, Miss. Laina",female,0,STON/O2. 3101282,7.9250,S
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,0,113803,53.1000,S
4,3,"Allen, Mr. William Henry",male,0,373450,8.0500,S
5,3,"Moran, Mr. James",male,0,330877,8.4583,Q
6,1,"McCarthy, Mr. Timothy J",male,0,17463,51.8625,S
7,3,"Palsson, Master. Gosta Leonard",male,1,349909,21.0750,S
8,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,2,347742,11.1333,S
9,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,0,237736,30.0708,C

## .Loc

In [28]:
#Let's Read csv file
titanic2 = pd.read_csv("Titanic-Dataset.csv",index_col ="Name")

In [29]:
titanic2

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
"Montvila, Rev. Juozas",887,0,2,male,27.0,0,0,211536,13.0000,NaN,S
"Graham, Miss. Margaret Edith",888,1,1,female,19.0,0,0,112053,30.0000,B42,S
"Johnston, Miss. Catherine Helen ""Carrie""",889,0,3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S
"Behr, Mr. Karl Howell",890,1,1,male,26.0,0,0,111369,30.0000,C148,C
"Dooley, Mr. Patrick",891,0,3,male,32.0,0,0,370376,7.7500,NaN,Q

### Selecting a single row

In [30]:
titanic.loc[1]

PassengerId                                                    2
Survived                                                       1
Pclass                                                         1
Name           Cumings, Mrs. John Bradley (Florence Briggs Th...
Sex                                                       female
Age                                                           38
SibSp                                                          1
Parch                                                          0
Ticket                                                  PC 17599
Fare                                                     71.2833
Cabin                                                        C85
Embarked                                                       C
Name: 1, dtype: object

In [31]:
#titanic2.loc[1]
titanic2.loc['Allen, Miss. Elisabeth Walton']

PassengerId        731
Survived             1
Pclass               1
Sex             female
Age                 29
SibSp                0
Parch                0
Ticket           24160
Fare           211.338
Cabin               B5
Embarked             S
Name: Allen, Miss. Elisabeth Walton, dtype: object

### Selecting multiple rows

In [32]:
titanic2.loc[['Allen, Miss. Elisabeth Walton','Allison, Miss. Helen Loraine']]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Allen, Miss. Elisabeth Walton",731,1,1,female,29.0,0,0,24160,211.3375,B5,S
"Allison, Miss. Helen Loraine",298,0,1,female,2.0,1,2,113781,151.5500,C22 C26,S

### Selecting two rows and three columns

In [34]:
titanic2.loc[['Allen, Miss. Elisabeth Walton','Allison, Miss. Helen Loraine'],['Pclass','Embarked','SibSp']]

                               Pclass Embarked  SibSp
Name
Allen, Miss. Elisabeth Walton       1        S      0
Allison, Miss. Helen Loraine        1        S      1

### Selecting all the rows and a some columns

In [35]:
titanic2.loc[:,['Pclass','Embarked','Fare']]

                                                    Pclass Embarked     Fare
Name
Braund, Mr. Owen Harris                                  3        S   7.2500
Cumings, Mrs. John Bradley (Florence Briggs Tha...       1        C  71.2833
Heikkinen, Miss. Laina                                   3        S   7.9250
Futrelle, Mrs. Jacques Heath (Lily May Peel)             1        S  53.1000
Allen, Mr. William Henry                                 3        S   8.0500
...                                                    ...      ...      ...
Montvila, Rev. Juozas                                    2        S  13.0000
Graham, Miss. Margaret Edith                             1        S  30.0000
Johnston, Miss. Catherine Helen "Carrie"                 3        S  23.4500
Behr, Mr. Karl Howell                                    1        C  30.0000
Dooley, Mr. Patrick                                      3        Q   7.7500

[891 rows x 3 columns]

# Query()

In [37]:
titanic.query('Survived == 1 and Embarked =="S" and Pclass == 1 and Fare > 200')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S
341,342,1,1,"Fortune, Miss. Alice Elizabeth",female,24.0,3,2,19950,263.0000,C23 C25 C27,S
689,690,1,1,"Madill, Miss. Georgette Alexandra",female,15.0,0,1,24160,211.3375,B5,S
730,731,1,1,"Allen, Miss. Elisabeth Walton",female,29.0,0,0,24160,211.3375,B5,S
779,780,1,1,"Robert, Mrs. Edward Scott (Elisabeth Walton Mc...",female,43.0,0,1,24160,211.3375,B3,S

In [38]:
titanic.loc[(titanic.Survived==1)&(titanic.Embarked=='S')&(titanic.Fare>200)&(titanic.Pclass==1)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S
341,342,1,1,"Fortune, Miss. Alice Elizabeth",female,24.0,3,2,19950,263.0000,C23 C25 C27,S
689,690,1,1,"Madill, Miss. Georgette Alexandra",female,15.0,0,1,24160,211.3375,B5,S
730,731,1,1,"Allen, Miss. Elisabeth Walton",female,29.0,0,0,24160,211.3375,B5,S
779,780,1,1,"Robert, Mrs. Edward Scott (Elisabeth Walton Mc...",female,43.0,0,1,24160,211.3375,B3,S

In [39]:
titanic.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [40]:
titanic[(titanic['Pclass']==1) & (titanic['Embarked']=='S') & (titanic['Fare']>200) & (titanic['Survived']==1)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S
341,342,1,1,"Fortune, Miss. Alice Elizabeth",female,24.0,3,2,19950,263.0000,C23 C25 C27,S
689,690,1,1,"Madill, Miss. Georgette Alexandra",female,15.0,0,1,24160,211.3375,B5,S
730,731,1,1,"Allen, Miss. Elisabeth Walton",female,29.0,0,0,24160,211.3375,B5,S
779,780,1,1,"Robert, Mrs. Edward Scott (Elisabeth Walton Mc...",female,43.0,0,1,24160,211.3375,B3,S